package _21102022;

public class Ex1 {

    /*
    * 1. Модификатор доступа ( public, private итд ) - может быть, а может и не быть
    * 2. Static -если статический метод, Если НЕ статический то STATIC не нужен. Может и не быть
    * 3. Возвращаемое значение. Если есть то ТИП ДАННЫХ, если нет то VOID. !!!ОБЯЗАПТЕЛЬНО!!!
    * 4. Имя метода(camel case and "а") !!!ОБЯЗАТЕЛьНО!!!
    * 5. Круглые скобки для парметров. Если есть параметр то в нем ТИП И ИМЯ, если нет то скобки пустые
    * 6. Если есть возвращаемое значение то слово RETURN
    * */
    public static void get() {
    }
    static String get(String s) {
        return null;
    }

    public static void main(String[] args) {

    }
}